{
  "traditions": [
    {
      "id": 1,
      "region": "Ethiopia",
      "title": "Ethiopian Coffee Ceremony",
      "shortDesc": "Experience the birthplace of coffee...",
      "fullContent": "The Ethiopian coffee ceremony is a unique and important part of Ethiopian culture. This intimate ceremony can last for hours and is typically performed by the woman of the household. The ceremony begins with the washing of green coffee beans, then roasting them in a pan over hot coals. The aromatic smoke is wafted around for everyone to appreciate, and the beans are then ground using a traditional mortar and pestle. The coffee is brewed three times: the first round called 'Abol', the second 'Tona', and the third 'Baraka'. Each round becomes progressively weaker but is equally important to the ceremony.",
      "traditions": [
        "Burning of incense during ceremony",
        "Three rounds of brewing",
        "Serving with snacks like popcorn",
        "Traditional clay pot (jebena) usage"
      ]
    },
    {
      "id": 2,
      "region": "Japan",
      "title": "Japanese Coffee Houses",
      "shortDesc": "The art of precision and patience...",
      "fullContent": "Japanese coffee culture is characterized by meticulous attention to detail and a deep respect for craft. The kissaten (traditional Japanese coffee houses) have been serving carefully brewed coffee since the early 20th century. These establishments often specialize in pour-over coffee, prepared with scientific precision. The Japanese approach to coffee brewing has influenced modern coffee culture worldwide, particularly in the popularity of pour-over methods and the emphasis on precise measurements and timing.",
      "traditions": [
        "Precise pour-over technique",
        "Traditional kissaten atmosphere",
        "Seasonal coffee menus",
        "Coffee equipment innovation"
      ]
    },
    {
      "id": 3,
      "region": "Italy",
      "title": "Italian Espresso Culture",
      "shortDesc": "The heart of espresso tradition...",
      "fullContent": "Italian coffee culture is perhaps the most influential in the world, giving us terms like espresso, cappuccino, and latte. In Italy, coffee is more than just a beverage - it's a way of life. The day begins with a cappuccino (never after 11 AM!) and continues with quick espresso shots at the local bar. Standing at the bar to drink your espresso is a typical Italian tradition, as is the social aspect of coffee drinking. The Italian approach to coffee has shaped café culture worldwide.",
      "traditions": [
        "Standing at the bar for espresso",
        "No cappuccino after 11 AM",
        "Social aspect of coffee drinking",
        "Regional coffee variations"
      ]
    }
  ]
}